app/Filament/Widgets/StatsOverview.php

    protected function getCards(): array
    {
        return [
            Card::make('Offres d\'emploi', Offre::count())
                ->description('Total des offres publiées')
                ->icon('heroicon-o-briefcase')
                ->color('warning'),

            Card::make('Recruteurs', User::where('role', 'recruteur')->count())
                ->description('Nombre total de recruteurs')
                ->icon('heroicon-o-briefcase')
                ->color('warning'),

            Card::make('Candidats', User::where('role', 'candidat')->count())
                ->description('Nombre total de candidats')
                ->icon('heroicon-o-user')
                ->color('success'),
---
select count(*) as aggregate from `users` where `role` = 'recruteur'
select count(*) as aggregate from `users` where `role` = 'candidat'